Show / Hide Table of Contents
Class PointOfID
Point of interaction diagram
Inheritance
System.Object
PointOfID
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Result
Assembly: IdeaRS.OpenModel.dll
Syntax
[Obfuscation(Feature = "renaming")]
public class PointOfID
Properties
Improve this Doc   View Source
My
Bending moment around y-axis
Declaration
public double My { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Mz
Bending moment around z-axis
Declaration
public double Mz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
N
Normal force
Declaration
public double N { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source